#!/usr/local/bin/perl

use strict 'vars';
#########################################################
#
# bbs.cgi for SpeedyCGI (written by FOX)
# 2004/12/02
#
#　必要なファイル(同じディレクトリに入れる)
#  public_html/test/bbs.cgi これ
#                  test/bbs-entry.cgi 各種初期処理(SETTING.TXT,ad関係読み込み等)
#                  test/bbs-main.cgi 本体
#                  /bbs-tool.cgi Samba用
#                  /bbs-yakin.cgi ●実装用
#
#########################################################

require "bbs-entry.cgi";

&bbs_entry	;

exit		;

#################################################################################################
#
#################################################################################################